//Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. 
//Напишите программу, которая покажет количество чётных чисел в массиве.
//[345, 897, 568, 234] -> 2

int[] arr = GetArray(7, 100, 999);
PrintArray(arr);
Console.WriteLine();
Console.WriteLine(CountEvenNums(arr));

int[] GetArray(int size, int minValue, int maxValue)
{
    int[] res = new int[size];
    for (int i = 0; i < size; i++)
    {
        res[i] = new Random().Next(minValue, maxValue + 1);
    }
    return res;
}

int CountEvenNums(int[] array)
{
    int s = 0;
    foreach (int j in array)
    {
        if (j % 2 == 0) s += 1;
    }
    return s;
}

void PrintArray(int[] col)
{
    int count = col.Length;
    int position = 0;
    while (position < count)
    {
        Console.Write($"{col[position]} ");
        position++;
    }
}